DataProcessors/ЗаполенениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЗаполенениеГрафика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДней</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рабочий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РабочийГрафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>РабочийГрафик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗаполенениеГрафика/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСписокДней(Команда)
	Если Объект.ДатаНачала = '0001-01-01' ИЛИ Объект.ДатаОкончания = '0001-01-01' Тогда
	
		Сообщить("Интервал не указан");
		ЭтотОбъект.ТекущийЭлемент = Элементы.ДатаНачала;
		Возврат;
	КонецЕсли;	
	
	Объект.СписокДней.Очистить();
	
	ТекущийДень = Объект.ДатаНачала;
	
	Пока ТекущийДень <= Объект.ДатаОкончания Цикл
		
		НоваяСтр = Объект.СписокДней.Добавить();
		НоваяСтр.Дата = ТекущийДень;
		НоваяСтр.Рабочий = (ДеньНедели(НоваяСтр.Дата) < 6);
		
		НоваяСтр.КоличествоЧасов = Объект.НормаЧасов;
		ТекущийДень = ТекущийДень + 86400;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеКалендаряНаСервере()
	Отбор = Новый Структура("Рабочий", Истина);
	ТаблицаГрафика = Объект.СписокДней.НайтиСтроки(Отбор);
	РегистрыСведений.РабочийГрафик.ЗаполнитьГрафикПоТаблице(ТаблицаГрафика);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКалендаря(Команда)
	Если Объект.СписокДней.Количество() = 0 Тогда
		Сообщить("Нет данных для импорта");
		Возврат;
	КонецЕсли;
	ЗагрузитьДанныеКалендаряНаСервере();
КонецПроцедуры
